CSI API ETABS v1
cFile.OpenFile Method
 Opens an existing file.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int OpenFile(
	string FileName
)
Function OpenFile (
	FileName As String
) As Integer
Dim instance As cFile
Dim FileName As String
Dim returnValue As Integer
returnValue = instance.OpenFile(FileName)
int OpenFile(
	String^ FileName
)
abstract OpenFile :
        FileName : string -> int
Parameters
FileName
Type: System.String
 The full path of a model file to be opened in the application.
Return Value
Type: Int32
 Returns zero if the file is successfully opened and nonzero if it is not opened.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim FileName as String
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'open an existing file - If no file exists, run the Save example first.
       FileName = "c:\CSI_API_temp\example.edb"
       ret = SapModel.File.OpenFile(FileName)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cFile Interface
ETABSv1 Namespace